IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_emac_tms570ls3x.xml
<?xml version="1.0" encoding="UTF-8"?><module id="EMAC" HW_revision="" XML_version="1" description="Common Platform Gigabit ethernet MAC">
     <register id="TXREV" acronym="TXREV" offset="0x0" width="32" description="Transmit Identification and Version Register ">
<bitfield id="TXREV" width="32" begin="31" end="0" resetval="1321206285" description="" range="" rwaccess="R"/>
</register>
     <register id="TXCONTROL" acronym="TXCONTROL" offset="0x4" width="32" description="Transmit Control Register">
<bitfield id="_RSVD" width="31" begin="31" end="1" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="TXEN" width="1" begin="0" end="0" resetval="0" description="Transmit enable" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="Transmit is disabled"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="Transmit is enabled"/>
</bitfield>
</register>
     <register id="TXTEARDOWN" acronym="TXTEARDOWN" offset="0x8" width="32" description="Transmit Teardown Register ">
<bitfield id="_RSVD" width="1" begin="31" end="31" resetval="0" description="TX teardown ready; read as zero, but always assumed to be one - unused" range="" rwaccess="N"/>
<bitfield id="_RSVD" width="28" begin="30" end="3" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="TXTDNCH" width="3" begin="2" end="0" resetval="0" description="TX teardown channed" range="0-7h" rwaccess="RW">
<bitenum id="CHA0" value="0" token="CHA0" description=""/>
<bitenum id="CHA1" value="1" token="CHA1" description=""/>
<bitenum id="CHA2" value="2" token="CHA2" description=""/>
<bitenum id="CHA3" value="3" token="CHA3" description=""/>
<bitenum id="CHA4" value="4" token="CHA4" description=""/>
<bitenum id="CHA5" value="5" token="CHA5" description=""/>
<bitenum id="CHA6" value="6" token="CHA6" description=""/>
<bitenum id="CHA7" value="7" token="CHA7" description=""/>
</bitfield>
</register>
     <register id="RXREV" acronym="RXREV" offset="0x10" width="32" description="RX Identification and Version Register ">
<bitfield id="RXREV" width="32" begin="31" end="0" resetval="1321206285" description="" range="" rwaccess="R"/>
</register>
     <register id="RXCONTROL" acronym="RXCONTROL" offset="0x14" width="32" description="RX Control Register">
<bitfield id="_RSVD" width="31" begin="31" end="1" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RXEN" width="1" begin="0" end="0" resetval="0" description="RX DMA enable" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="Receive is disabled"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="Receive is enabled"/>
</bitfield>
</register>
     <register id="RXTEARDOWN" acronym="RXTEARDOWN" offset="0x18" width="32" description="RX Teardown Register ">
<bitfield id="_RSVD" width="1" begin="31" end="31" resetval="0" description="Teardown ready; read as zero, but it is always assumed to be one - unused" range="" rwaccess="N"/>
<bitfield id="_RSVD" width="28" begin="30" end="3" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RXTDNCH" width="3" begin="2" end="0" resetval="0" description="RX teardown channel" range="0-7h" rwaccess="RW">
<bitenum id="CHA0" value="0" token="CHA0" description=""/>
<bitenum id="CHA1" value="1" token="CHA1" description=""/>
<bitenum id="CHA2" value="2" token="CHA2" description=""/>
<bitenum id="CHA3" value="3" token="CHA3" description=""/>
<bitenum id="CHA4" value="4" token="CHA4" description=""/>
<bitenum id="CHA5" value="5" token="CHA5" description=""/>
<bitenum id="CHA6" value="6" token="CHA6" description=""/>
<bitenum id="CHA7" value="7" token="CHA7" description=""/>
</bitfield>
</register>
     <register id="TXINTSTATRAW" acronym="TXINTSTATRAW" offset="0x80" width="32" description="Transmit Interrupt Status Register">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="TX7PEND" width="1" begin="7" end="7" resetval="0" description="TX7PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="TX6PEND" width="1" begin="6" end="6" resetval="0" description="TX6PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="TX5PEND" width="1" begin="5" end="5" resetval="0" description="TX5PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="TX4PEND" width="1" begin="4" end="4" resetval="0" description="TX4PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="TX3PEND" width="1" begin="3" end="3" resetval="0" description="TX3PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="TX2PEND" width="1" begin="2" end="2" resetval="0" description="TX2PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="TX1PEND" width="1" begin="1" end="1" resetval="0" description="TX1PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="TX0PEND" width="1" begin="0" end="0" resetval="0" description="TX0PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
</register>
     <register id="TXINTSTATMASKED" acronym="TXINTSTATMASKED" offset="0x84" width="32" description="Transmit Interrupt Status Register Masked">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="TX7PEND" width="1" begin="7" end="7" resetval="0" description="TX7PEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="TX6PEND" width="1" begin="6" end="6" resetval="0" description="TX6PEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="TX5PEND" width="1" begin="5" end="5" resetval="0" description="TX5PEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="TX4PEND" width="1" begin="4" end="4" resetval="0" description="TX4PEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="TX3PEND" width="1" begin="3" end="3" resetval="0" description="TX3PEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="TX2PEND" width="1" begin="2" end="2" resetval="0" description="TX2PEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="TX1PEND" width="1" begin="1" end="1" resetval="0" description="TX1PEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="TX0PEND" width="1" begin="0" end="0" resetval="0" description="TX0PEND masked interrupt read" range="" rwaccess="R"/>
</register>
     <register id="TXINTMASKSET" acronym="TXINTMASKSET" offset="0x88" width="32" description="Transmit Interrupt Mask Set Register">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="TX7MASK" width="1" begin="7" end="7" resetval="0" description="TX channel 7 interrupt pending mask set bit - Write one to enable" range="" rwaccess="RW"/>
<bitfield id="TX6MASK" width="1" begin="6" end="6" resetval="0" description="TX channel 6 interrupt pending mask set bit - Write one to enable" range="" rwaccess="RW"/>
<bitfield id="TX5MASK" width="1" begin="5" end="5" resetval="0" description="TX channel 5 interrupt pending mask set bit - Write one to enable" range="" rwaccess="RW"/>
<bitfield id="TX4MASK" width="1" begin="4" end="4" resetval="0" description="TX channel 4 interrupt pending mask set bit - Write one to enable" range="" rwaccess="RW"/>
<bitfield id="TX3MASK" width="1" begin="3" end="3" resetval="0" description="TX channel 3 interrupt pending mask set bit - Write one to enable" range="" rwaccess="RW"/>
<bitfield id="TX2MASK" width="1" begin="2" end="2" resetval="0" description="TX channel 2 interrupt pending mask set bit - Write one to enable" range="" rwaccess="RW"/>
<bitfield id="TX1MASK" width="1" begin="1" end="1" resetval="0" description="TX channel 1 interrupt pending mask set bit - Write one to enable" range="" rwaccess="RW"/>
<bitfield id="TX0MASK" width="1" begin="0" end="0" resetval="0" description="TX channel 0 interrupt pending mask set bit - Write one to enable" range="" rwaccess="RW"/>
</register>
