IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_emac_tms570ls3x.xml
     <register id="TXINTMASKCLEAR" acronym="TXINTMASKCLEAR" offset="0x8c" width="32" description="Transmit Interrupt Clear Register ">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="TX7MASK" width="1" begin="7" end="7" resetval="0" description="TX channel 7 interrupt pending mask set bit - Write one to disable" range="" rwaccess="RW"/>
<bitfield id="TX6MASK" width="1" begin="6" end="6" resetval="0" description="TX channel 6 interrupt pending mask set bit - Write one to disable" range="" rwaccess="RW"/>
<bitfield id="TX5MASK" width="1" begin="5" end="5" resetval="0" description="TX channel 5 interrupt pending mask set bit - Write one to disable" range="" rwaccess="RW"/>
<bitfield id="TX4MASK" width="1" begin="4" end="4" resetval="0" description="TX channel 4 interrupt pending mask set bit - Write one to disable" range="" rwaccess="RW"/>
<bitfield id="TX3MASK" width="1" begin="3" end="3" resetval="0" description="TX channel 3 interrupt pending mask set bit - Write one to disable" range="" rwaccess="RW"/>
<bitfield id="TX2MASK" width="1" begin="2" end="2" resetval="0" description="TX channel 2 interrupt pending mask set bit - Write one to disable" range="" rwaccess="RW"/>
<bitfield id="TX1MASK" width="1" begin="1" end="1" resetval="0" description="TX channel 1 interrupt pending mask set bit - Write one to disable" range="" rwaccess="RW"/>
<bitfield id="TX0MASK" width="1" begin="0" end="0" resetval="0" description="TX channel 0 interrupt pending mask set bit - Write one to disable" range="" rwaccess="RW"/>
</register>
     <register id="MACINVECTOR" acronym="MACINVECTOR" offset="0x90" width="32" description="MAC Input Vector Register ">
<bitfield id="_RSVD" width="4" begin="31" end="28" resetval="0" description="Reserved (Input Vector defined in CPGMACSS_R doc)" range="" rwaccess="N"/>
<bitfield id="STATPEND" width="1" begin="27" end="27" resetval="0" description="Status Pending" range="" rwaccess="R"/>
<bitfield id="HOSTPEND" width="1" begin="26" end="26" resetval="0" description="Host Pending" range="" rwaccess="R"/>
<bitfield id="LINKINT0" width="1" begin="25" end="25" resetval="0" description="MDIO Link Int" range="" rwaccess="R"/>
<bitfield id="USERINT0" width="1" begin="24" end="24" resetval="0" description="MDIO User Int" range="" rwaccess="R"/>
<bitfield id="TXPEND" width="8" begin="23" end="16" resetval="0" description="TX Pend[7:0]" range="" rwaccess="R"/>
<bitfield id="RXTHRESHPEND" width="8" begin="15" end="8" resetval="0" description="RX Thresh Pend[7:0]" range="" rwaccess="R"/>
<bitfield id="RXPEND" width="8" begin="7" end="0" resetval="0" description="RX Pend[7:0]" range="" rwaccess="R"/>
</register>
     <register id="MACEOIVECTOR" acronym="MACEOIVECTOR" offset="0x94" width="32" description="MAC End of Interrupt Vector">
<bitfield id="_RSVD" width="27" begin="31" end="5" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="INTVECT" width="5" begin="4" end="0" resetval="0" description="MAC End of Interrupt Vector; reflects the value written to this location one  VBUSP_CLK cycle after a write to this location." range="" rwaccess="RW">
<bitenum id="C0RXTHRESH" value="0" token="C0RXTHRESH" description=""/>
<bitenum id="C0RX" value="1" token="C0RX" description=""/>
<bitenum id="C0TX" value="2" token="C0TX" description=""/>
<bitenum id="C0MISC" value="3" token="C0MISC" description=""/>
<bitenum id="C1RXTHRESH" value="4" token="C1RXTHRESH" description=""/>
<bitenum id="C1RX" value="5" token="C1RX" description=""/>
<bitenum id="C1TX" value="6" token="C1TX" description=""/>
<bitenum id="C1MISC" value="7" token="C1MISC" description=""/>
</bitfield>
</register>
     <register id="RXINTSTATRAW" acronym="RXINTSTATRAW" offset="0xA0" width="32" description="Receive Interrupt Status Register Raw">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX7THRESHPEND" width="1" begin="15" end="15" resetval="0" description="RX7THRESHPEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="RX6THRESHPEND" width="1" begin="14" end="14" resetval="0" description="RX6THRESHPEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="RX5THRESHPEND" width="1" begin="13" end="13" resetval="0" description="RX5THRESHPEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="RX4THRESHPEND" width="1" begin="12" end="12" resetval="0" description="RX4THRESHPEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="RX3THRESHPEND" width="1" begin="11" end="11" resetval="0" description="RX3THRESHPEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="RX2THRESHPEND" width="1" begin="10" end="10" resetval="0" description="RX2THRESHPEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="RX1THRESHPEND" width="1" begin="9" end="9" resetval="0" description="RX1THRESHPEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="RX0THRESHPEND" width="1" begin="8" end="8" resetval="0" description="RX0THRESHPEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="RX7PEND" width="1" begin="7" end="7" resetval="0" description="RX7PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="RX6PEND" width="1" begin="6" end="6" resetval="0" description="RX6PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="RX5PEND" width="1" begin="5" end="5" resetval="0" description="RX5PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="RX4PEND" width="1" begin="4" end="4" resetval="0" description="RX4PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="RX3PEND" width="1" begin="3" end="3" resetval="0" description="RX3PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="RX2PEND" width="1" begin="2" end="2" resetval="0" description="RX2PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="RX1PEND" width="1" begin="1" end="1" resetval="0" description="RX1PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="RX0PEND" width="1" begin="0" end="0" resetval="0" description="RX0PEND raw interrupt read (before mask)" range="" rwaccess="R"/>
</register>
