IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_emac_tms570ls3x.xml
     <register id="RXINTSTATMASKED" acronym="RXINTSTATMASKED" offset="0xA4" width="32" description="Receive Interrupt Status Register Masked">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX7THRESHPEND" width="1" begin="15" end="15" resetval="0" description="RX7THRESHPEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="RX6THRESHPEND" width="1" begin="14" end="14" resetval="0" description="RX6THRESHPEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="RX5THRESHPEND" width="1" begin="13" end="13" resetval="0" description="RX5THRESHPEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="RX4THRESHPEND" width="1" begin="12" end="12" resetval="0" description="RX4THRESHPEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="RX3THRESHPEND" width="1" begin="11" end="11" resetval="0" description="RX3THRESHPEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="RX2THRESHPEND" width="1" begin="10" end="10" resetval="0" description="RX2THRESHPEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="RX1THRESHPEND" width="1" begin="9" end="9" resetval="0" description="RX1THRESHPEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="RX0THRESHPEND" width="1" begin="8" end="8" resetval="0" description="RX0THRESHPEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="RX7PEND" width="1" begin="7" end="7" resetval="0" description="RX7PEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="RX6PEND" width="1" begin="6" end="6" resetval="0" description="RX6PEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="RX5PEND" width="1" begin="5" end="5" resetval="0" description="RX5PEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="RX4PEND" width="1" begin="4" end="4" resetval="0" description="RX4PEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="RX3PEND" width="1" begin="3" end="3" resetval="0" description="RX3PEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="RX2PEND" width="1" begin="2" end="2" resetval="0" description="RX2PEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="RX1PEND" width="1" begin="1" end="1" resetval="0" description="RX1PEND masked interrupt read" range="" rwaccess="R"/>
<bitfield id="RX0PEND" width="1" begin="0" end="0" resetval="0" description="RX0PEND masked interrupt read" range="" rwaccess="R"/>
</register>
     <register id="RXINTMASKSET" acronym="RXINTMASKSET" offset="0xA8" width="32" description="Receive Interrupt Mask Set Register">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX7THRESHMASK" width="1" begin="15" end="15" resetval="0" description="Receive Channel 7 Threshold Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX6THRESHMASK" width="1" begin="14" end="14" resetval="0" description="Receive Channel 6 Threshold Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX5THRESHMASK" width="1" begin="13" end="13" resetval="0" description="Receive Channel 5 Threshold Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX4THRESHMASK" width="1" begin="12" end="12" resetval="0" description="Receive Channel 4 Threshold Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX3THRESHMASK" width="1" begin="11" end="11" resetval="0" description="Receive Channel 3 Threshold Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX2THRESHMASK" width="1" begin="10" end="10" resetval="0" description="Receive Channel 2 Threshold Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX1THRESHMASK" width="1" begin="9" end="9" resetval="0" description="Receive Channel 1 Threshold Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX0THRESHMASK" width="1" begin="8" end="8" resetval="0" description="Receive Channel 0 Threshold Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX7MASK" width="1" begin="7" end="7" resetval="0" description="Receive Channel 7 Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX6MASK" width="1" begin="6" end="6" resetval="0" description="Receive Channel 6 Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX5MASK" width="1" begin="5" end="5" resetval="0" description="Receive Channel 5 Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX4MASK" width="1" begin="4" end="4" resetval="0" description="Receive Channel 4 Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX3MASK" width="1" begin="3" end="3" resetval="0" description="Receive Channel 3 Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX2MASK" width="1" begin="2" end="2" resetval="0" description="Receive Channel 2 Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX1MASK" width="1" begin="1" end="1" resetval="0" description="Receive Channel 1 Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX0MASK" width="1" begin="0" end="0" resetval="0" description="Receive Channel 0 Pending Mask; write one to enable interrupt" range="" rwaccess="RW"/>
</register>
     <register id="RXINTMASKCLEAR" acronym="RXINTMASKCLEAR" offset="0xAC" width="32" description="Receive Interrupt Mask Clear Register">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX7THRESHMASK" width="1" begin="15" end="15" resetval="0" description="Receive Channel 7 Threshold Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX6THRESHMASK" width="1" begin="14" end="14" resetval="0" description="Receive Channel 6 Threshold Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX5THRESHMASK" width="1" begin="13" end="13" resetval="0" description="Receive Channel 5 Threshold Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX4THRESHMASK" width="1" begin="12" end="12" resetval="0" description="Receive Channel 4 Threshold Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX3THRESHMASK" width="1" begin="11" end="11" resetval="0" description="Receive Channel 3 Threshold Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX2THRESHMASK" width="1" begin="10" end="10" resetval="0" description="Receive Channel 2 Threshold Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX1THRESHMASK" width="1" begin="9" end="9" resetval="0" description="Receive Channel 1 Threshold Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX0THRESHMASK" width="1" begin="8" end="8" resetval="0" description="Receive Channel 0 Threshold Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX7MASK" width="1" begin="7" end="7" resetval="0" description="Receive Channel 7 Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX6MASK" width="1" begin="6" end="6" resetval="0" description="Receive Channel 6 Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX5MASK" width="1" begin="5" end="5" resetval="0" description="Receive Channel 5 Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX4MASK" width="1" begin="4" end="4" resetval="0" description="Receive Channel 4 Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX3MASK" width="1" begin="3" end="3" resetval="0" description="Receive Channel 3 Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX2MASK" width="1" begin="2" end="2" resetval="0" description="Receive Channel 2 Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX1MASK" width="1" begin="1" end="1" resetval="0" description="Receive Channel 1 Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="RX0MASK" width="1" begin="0" end="0" resetval="0" description="Receive Channel 0 Pending Mask; write one to disable interrupt" range="" rwaccess="RW"/>
</register>
     <register id="MACINTSTATRAW" acronym="MACINTSTATRAW" offset="0xB0" width="32" description="MAC Interrupt Status Register Raw (Unmasked)">
<bitfield id="_RSVD" width="30" begin="31" end="2" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="HOSTPEND" width="1" begin="1" end="1" resetval="0" description="Host pending interrupt; raw interrupt read (before mask)" range="" rwaccess="R"/>
<bitfield id="STATPEND" width="1" begin="0" end="0" resetval="0" description="Statistics pending interrupt; raw interrupt read (before mask)" range="" rwaccess="R"/>
</register>
     <register id="MACINTSTATMASKED" acronym="MACINTSTATMASKED" offset="0xB4" width="32" description="MAC Interrupt Status Register Masked">
<bitfield id="_RSVD" width="30" begin="31" end="2" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="HOSTPEND" width="1" begin="1" end="1" resetval="0" description="Host pending interrupt; masked interrupt read" range="" rwaccess="R"/>
<bitfield id="STATPEND" width="1" begin="0" end="0" resetval="0" description="Statistics pending interrupt; masked interrupt read " range="" rwaccess="R"/>
</register>
