IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_emac_tms570ls3x.xml
     <register id="MACINTMASKSET" acronym="MACINTMASKSET" offset="0xB8" width="32" description="MAC Interrupt Mask Set Register">
<bitfield id="_RSVD" width="30" begin="31" end="2" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="HOSTMASK" width="1" begin="1" end="1" resetval="0" description="Host error interrupt mask; write one to enable interrupt" range="" rwaccess="RW"/>
<bitfield id="STATMASK" width="1" begin="0" end="0" resetval="0" description="Statistics interrupt;mask; write one to enable interrupt " range="" rwaccess="RW"/>
</register>
     <register id="MACINTMASKCLEAR" acronym="MACINTMASKCLEAR" offset="0xBC" width="32" description="MAC Interrupt Mask Clear Register">
<bitfield id="_RSVD" width="30" begin="31" end="2" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="HOSTMASK" width="1" begin="1" end="1" resetval="0" description="Host error interrupt mask; write one to disable interrupt" range="" rwaccess="RW"/>
<bitfield id="STATMASK" width="1" begin="0" end="0" resetval="0" description="Statistics interrupt;mask; write one to disable interrupt " range="" rwaccess="RW"/>
</register>
     <register id="RXMBPENABLE" acronym="RXMBPENABLE" offset="0x100" width="32" description="Receive Multicast/Broadcast/Promiscuous Channel Enable Register ">
<bitfield id="_RSVD" width="1" begin="31" end="31" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RXPASSCRC" width="1" begin="30" end="30" resetval="0" description="Pass receive CRC enable " range="" rwaccess="RW">
<bitenum id="DISCARD" value="0" token="DISCARD" description="Received CRC is discarded for all channels and is not included in the buffer descriptor packet length field"/>
<bitenum id="INCLUDE" value="1" token="INCLUDE" description="Received CRC is transferred to memory for all channels and is included in the buffer descriptor packet length"/>
</bitfield>
<bitfield id="RXQOSEN" width="1" begin="29" end="29" resetval="0" description="Receive quality of service enable " range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="Receive QOS is disabled"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="Receive QOS is enabled"/>
</bitfield>
<bitfield id="RXNOCHAIN" width="1" begin="28" end="28" resetval="0" description="Receive no buffer chaining " range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="Received frames can span multiple buffers"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="RX DMA controller transfers each frame into a single buffer regardless of the frame or buffer size. All remaining frame data after the first buffer is discarded"/>
</bitfield>
<bitfield id="_RSVD" width="3" begin="27" end="25" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RXCMFEN" width="1" begin="24" end="24" resetval="0" description="Receive copy MAC control frames enable " range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="MAC control frames are filtered (but acted upon if enabled)"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="MAC control frames are transferred to memory"/>
</bitfield>
<bitfield id="RXCSFEN" width="1" begin="23" end="23" resetval="0" description="Receive copy short frames enable " range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="Short frames are filtered"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="Short frames are transferred to memory"/>
</bitfield>
<bitfield id="RXCEFEN" width="1" begin="22" end="22" resetval="0" description="Receive copy error frames enable" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="Frames containing errors are filtered"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="Frames containing errors are transferred to memory"/>
</bitfield>
<bitfield id="RXCAFEN" width="1" begin="21" end="21" resetval="0" description="Receive copy all frames enable" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="Frames that do not address match are transferred to the promiscuous channel selected by RXPROMCH bits"/>
</bitfield>
<bitfield id="_RSVD" width="2" begin="20" end="19" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RXPROMCH" width="3" begin="18" end="16" resetval="0" description="Receive promiscuous channel select" range="0-7h" rwaccess="RW">
<bitenum id="CHA0" value="0" token="CHA0" description=""/>
<bitenum id="CHA1" value="1" token="CHA1" description=""/>
<bitenum id="CHA2" value="2" token="CHA2" description=""/>
<bitenum id="CHA3" value="3" token="CHA3" description=""/>
<bitenum id="CHA4" value="4" token="CHA4" description=""/>
<bitenum id="CHA5" value="5" token="CHA5" description=""/>
<bitenum id="CHA6" value="6" token="CHA6" description=""/>
<bitenum id="CHA7" value="7" token="CHA7" description=""/>
</bitfield>
<bitfield id="_RSVD" width="2" begin="15" end="14" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RXBROADEN" width="1" begin="13" end="13" resetval="0" description="Receive broadcast enable" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="Broadcast frames are filtered"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="Broadcast frames are copied to the channel selected by RXBROADCH bits"/>
</bitfield>
<bitfield id="_RSVD" width="2" begin="12" end="11" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RXBROADCH" width="3" begin="10" end="8" resetval="0" description="Receive broadcast channel select" range="0-7h" rwaccess="RW">
<bitenum id="CHA0" value="0" token="CHA0" description=""/>
<bitenum id="CHA1" value="1" token="CHA1" description=""/>
<bitenum id="CHA2" value="2" token="CHA2" description=""/>
<bitenum id="CHA3" value="3" token="CHA3" description=""/>
<bitenum id="CHA4" value="4" token="CHA4" description=""/>
<bitenum id="CHA5" value="5" token="CHA5" description=""/>
<bitenum id="CHA6" value="6" token="CHA6" description=""/>
<bitenum id="CHA7" value="7" token="CHA7" description=""/>
</bitfield>
<bitfield id="_RSVD" width="2" begin="7" end="6" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RXMULTEN" width="1" begin="5" end="5" resetval="0" description="RX multicast enable" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="Multicast frames are filtered"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="Multicast frames are copied to the channel selected by RXMULTCH bits"/>
</bitfield>
<bitfield id="_RSVD" width="2" begin="4" end="3" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RXMULTCH" width="3" begin="2" end="0" resetval="0" description="RX multicast channel select" range="0-7h" rwaccess="RW">
<bitenum id="CHA0" value="0" token="CHA0" description=""/>
<bitenum id="CHA1" value="1" token="CHA1" description=""/>
<bitenum id="CHA2" value="2" token="CHA2" description=""/>
<bitenum id="CHA3" value="3" token="CHA3" description=""/>
<bitenum id="CHA4" value="4" token="CHA4" description=""/>
<bitenum id="CHA5" value="5" token="CHA5" description=""/>
<bitenum id="CHA6" value="6" token="CHA6" description=""/>
<bitenum id="CHA7" value="7" token="CHA7" description=""/>
</bitfield>
</register>
     <register id="RXUNICASTSET" acronym="RXUNICASTSET" offset="0x104" width="32" description="Receive Unicast Enable Set Register ">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RXCH7EN" width="1" begin="7" end="7" resetval="0" description="RX channel 7 unicast enable set" range="" rwaccess="RW">
<bitenum id="SET" value="1" token="SET" description=""/>
</bitfield>
<bitfield id="RXCH6EN" width="1" begin="6" end="6" resetval="0" description="RX channel 6 unicast enable set" range="" rwaccess="RW">
<bitenum id="SET" value="1" token="SET" description=""/>
</bitfield>
<bitfield id="RXCH5EN" width="1" begin="5" end="5" resetval="0" description="RX channel 5 unicast enable set" range="" rwaccess="RW">
<bitenum id="SET" value="1" token="SET" description=""/>
</bitfield>
<bitfield id="RXCH4EN" width="1" begin="4" end="4" resetval="0" description="RX channel 4 unicast enable set" range="" rwaccess="RW">
<bitenum id="SET" value="1" token="SET" description=""/>
</bitfield>
<bitfield id="RXCH3EN" width="1" begin="3" end="3" resetval="0" description="RX channel 3 unicast enable set" range="" rwaccess="RW">
<bitenum id="SET" value="1" token="SET" description=""/>
</bitfield>
<bitfield id="RXCH2EN" width="1" begin="2" end="2" resetval="0" description="RX channel 2 unicast enable set" range="" rwaccess="RW">
<bitenum id="SET" value="1" token="SET" description=""/>
</bitfield>
<bitfield id="RXCH1EN" width="1" begin="1" end="1" resetval="0" description="RX channel 1 unicast enable set" range="" rwaccess="RW">
<bitenum id="SET" value="1" token="SET" description=""/>
</bitfield>
<bitfield id="RXCH0EN" width="1" begin="0" end="0" resetval="0" description="RX channel 0 unicast enable set" range="" rwaccess="RW">
<bitenum id="SET" value="1" token="SET" description=""/>
</bitfield>
</register>
     <register id="RXUNICASTCLEAR" acronym="RXUNICASTCLEAR" offset="0x108" width="32" description="Receive Unicast Clear Register ">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RXCH7EN" width="1" begin="7" end="7" resetval="0" description="RX channel 7 unicast enable clear" range="" rwaccess="RW">
<bitenum id="CLEAR" value="1" token="CLEAR" description=""/>
</bitfield>
<bitfield id="RXCH6EN" width="1" begin="6" end="6" resetval="0" description="RX channel 6 unicast enable clear" range="" rwaccess="RW">
<bitenum id="CLEAR" value="1" token="CLEAR" description=""/>
</bitfield>
<bitfield id="RXCH5EN" width="1" begin="5" end="5" resetval="0" description="RX channel 5 unicast enable clear" range="" rwaccess="RW">
<bitenum id="CLEAR" value="1" token="CLEAR" description=""/>
</bitfield>
<bitfield id="RXCH4EN" width="1" begin="4" end="4" resetval="0" description="RX channel 4 unicast enable clear" range="" rwaccess="RW">
<bitenum id="CLEAR" value="1" token="CLEAR" description=""/>
</bitfield>
<bitfield id="RXCH3EN" width="1" begin="3" end="3" resetval="0" description="RX channel 3 unicast enable clear" range="" rwaccess="RW">
<bitenum id="CLEAR" value="1" token="CLEAR" description=""/>
</bitfield>
<bitfield id="RXCH2EN" width="1" begin="2" end="2" resetval="0" description="RX channel 2 unicast enable clear" range="" rwaccess="RW">
<bitenum id="CLEAR" value="1" token="CLEAR" description=""/>
</bitfield>
<bitfield id="RXCH1EN" width="1" begin="1" end="1" resetval="0" description="RX channel 1 unicast enable clear" range="" rwaccess="RW">
<bitenum id="CLEAR" value="1" token="CLEAR" description=""/>
</bitfield>
<bitfield id="RXCH0EN" width="1" begin="0" end="0" resetval="0" description="RX channel 0 unicast enable clear" range="" rwaccess="RW">
<bitenum id="CLEAR" value="1" token="CLEAR" description=""/>
</bitfield>
</register>
     <register id="RXMAXLEN" acronym="RXMAXLEN" offset="0x10C" width="32" description="Receive Maximum Length Register ">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RXMAXLEN" width="16" begin="15" end="0" resetval="1518" description="RX maximum frame length" range="" rwaccess="RW"/>
</register>
     <register id="RXBUFFEROFFSET" acronym="RXBUFFEROFFSET" offset="0x110" width="32" description="Receive Buffer Offset Register ">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RXBUFFEROFFSET" width="16" begin="15" end="0" resetval="0" description="RX buffer offset value" range="0-FFFFh" rwaccess="RW"/>
</register>
     <register id="RXFILTERLOWTHRESH" acronym="RXFILTERLOWTHRESH" offset="0x114" width="32" description="Receive Filter Low Priority Frame Threshold Register ">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RXFILTERTHRESH" width="8" begin="7" end="0" resetval="0" description="RX filter low threshold" range="0-FFh" rwaccess="RW"/>
</register>
