IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_emac_tms570ls3x.xml
     <register id="RX0FLOWTHRESH" acronym="RX0FLOWTHRESH" offset="0x120" width="32" description="Receive Channel 0 Flow Control Threshold Register ">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX0FLOWTHRESH" width="8" begin="7" end="0" resetval="0" description="RX flow threshold" range="0-FFh" rwaccess="RW"/>
</register>
     <register id="RX1FLOWTHRESH" acronym="RX1FLOWTHRESH" offset="0x124" width="32" description="Receive Channel 1 Flow Control Threshold Register ">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX1FLOWTHRESH" width="8" begin="7" end="0" resetval="0" description="RX flow threshold" range="0-FFh" rwaccess="RW"/>
</register>
     <register id="RX2FLOWTHRESH" acronym="RX2FLOWTHRESH" offset="0x128" width="32" description="Receive Channel 2 Flow Control Threshold Register ">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX2FLOWTHRESH" width="8" begin="7" end="0" resetval="0" description="RX flow threshold" range="0-FFh" rwaccess="RW"/>
</register>
     <register id="RX3FLOWTHRESH" acronym="RX3FLOWTHRESH" offset="0x12C" width="32" description="Receive Channel 3 Flow Control Threshold Register ">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX3FLOWTHRESH" width="8" begin="7" end="0" resetval="0" description="RX flow threshold" range="0-FFh" rwaccess="RW"/>
</register>
     <register id="RX4FLOWTHRESH" acronym="RX4FLOWTHRESH" offset="0x130" width="32" description="Receive Channel 4 Flow Control Threshold Register ">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX4FLOWTHRESH" width="8" begin="7" end="0" resetval="0" description="RX flow threshold" range="0-FFh" rwaccess="RW"/>
</register>
     <register id="RX5FLOWTHRESH" acronym="RX5FLOWTHRESH" offset="0x134" width="32" description="Receive Channel 5 Flow Control Threshold Register ">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX5FLOWTHRESH" width="8" begin="7" end="0" resetval="0" description="RX flow threshold" range="0-FFh" rwaccess="RW"/>
</register>
     <register id="RX6FLOWTHRESH" acronym="RX6FLOWTHRESH" offset="0x138" width="32" description="Receive Channel 6 Flow Control Threshold Register ">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX6FLOWTHRESH" width="8" begin="7" end="0" resetval="0" description="RX flow threshold" range="0-FFh" rwaccess="RW"/>
</register>
     <register id="RX7FLOWTHRESH" acronym="RX7FLOWTHRESH" offset="0x13C" width="32" description="Receive Channel 7 Flow Control Threshold Register ">
<bitfield id="_RSVD" width="24" begin="31" end="8" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX7FLOWTHRESH" width="8" begin="7" end="0" resetval="0" description="RX flow threshold" range="0-FFh" rwaccess="RW"/>
</register>
     <register id="RX0FREEBUFFER" acronym="RX0FREEBUFFER" offset="0x140" width="32" description="Receive Channel 0 Free Buffer Count Register ">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX0FREEBUF" width="16" begin="15" end="0" resetval="0" description="RX free buffer count; Write to increment" range="0-FFFFh" rwaccess="W"/>
</register>
     <register id="RX1FREEBUFFER" acronym="RX1FREEBUFFER" offset="0x144" width="32" description="Receive Channel 1 Free Buffer Count Register ">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX1FREEBUF" width="16" begin="15" end="0" resetval="0" description="RX free buffer count; Write to increment" range="0-FFFFh" rwaccess="W"/>
</register>
     <register id="RX2FREEBUFFER" acronym="RX2FREEBUFFER" offset="0x148" width="32" description="Receive Channel 2 Free Buffer Count Register ">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX2FREEBUF" width="16" begin="15" end="0" resetval="0" description="RX free buffer count; Write to increment" range="0-FFFFh" rwaccess="W"/>
</register>
     <register id="RX3FREEBUFFER" acronym="RX3FREEBUFFER" offset="0x14C" width="32" description="Receive Channel 3 Free Buffer Count Register ">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX3FREEBUF" width="16" begin="15" end="0" resetval="0" description="RX free buffer count; Write to increment" range="0-FFFFh" rwaccess="W"/>
</register>
     <register id="RX4FREEBUFFER" acronym="RX4FREEBUFFER" offset="0x150" width="32" description="Receive Channel 4 Free Buffer Count Register ">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX4FREEBUF" width="16" begin="15" end="0" resetval="0" description="RX free buffer count; Write to increment" range="0-FFFFh" rwaccess="W"/>
</register>
     <register id="RX5FREEBUFFER" acronym="RX5FREEBUFFER" offset="0x154" width="32" description="Receive Channel 5 Free Buffer Count Register ">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX5FREEBUF" width="16" begin="15" end="0" resetval="0" description="RX free buffer count; Write to increment" range="0-FFFFh" rwaccess="W"/>
</register>
     <register id="RX6FREEBUFFER" acronym="RX6FREEBUFFER" offset="0x158" width="32" description="Receive Channel 6 Free Buffer Count Register ">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX6FREEBUF" width="16" begin="15" end="0" resetval="0" description="RX free buffer count; Write to increment" range="0-FFFFh" rwaccess="W"/>
</register>
