IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_emac_tms570ls3x.xml
     <register id="RX7FREEBUFFER" acronym="RX7FREEBUFFER" offset="0x15C" width="32" description="Receive Channel 7 Free Buffer Count Register ">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RX7FREEBUF" width="16" begin="15" end="0" resetval="0" description="RX free buffer count; Write to increment" range="0-FFFFh" rwaccess="W"/>
</register>
     <register id="MACCONTROL" acronym="MACCONTROL" offset="0x160" width="32" description="MAC Control Register ">
<bitfield id="_RSVD" width="13" begin="31" end="19" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="_RSVD" width="1" begin="18" end="18" resetval="0" description="Enables external select of Dupex/Gigabit modes" range="" rwaccess="N"/>
<bitfield id="_RSVD" width="1" begin="17" end="17" resetval="0" description="Gigabit force mode" range="" rwaccess="N"/>
<bitfield id="_RSVD" width="1" begin="16" end="16" resetval="0" description="Interface Control B" range="" rwaccess="N"/>
<bitfield id="RMIISPEED" width="1" begin="15" end="15" resetval="0" description="RMII 10/100 Speed Select (IFCTLA)" range="" rwaccess="RW">
<bitenum id="10MBIT" value="0" token="10MBIT" description=""/>
<bitenum id="100MBIT" value="1" token="100MBIT" description=""/>
</bitfield>
<bitfield id="RXOFFLENBLOCK" width="1" begin="14" end="14" resetval="0" description="Receive Offset / Length word write block" range="" rwaccess="RW">
<bitenum id="NOBLOCK" value="0" token="NOBLOCK" description="Do not block the DMA writes to the receive buffer descriptor offset/buffer length word"/>
<bitenum id="BLOCK" value="1" token="BLOCK" description="Block all EMAC DMA controller writes to the receive buffer descriptor offset/buffer length words during CPPI packet processing. When this bit is set, the EMAC will never write the third word to any receive buffer descriptor"/>
</bitfield>
<bitfield id="RXOWNERSHIP" width="1" begin="13" end="13" resetval="0" description="Receive ownership write bit value" range="" rwaccess="RW">
<bitenum id="ZERO" value="0" token="ZERO" description="The EMAC writes the RX ownership bit to zero at the end of packet processing "/>
<bitenum id="ONE" value="1" token="ONE" description="The EMAC writes the RX ownership bit to one at the end of packet processing "/>
</bitfield>
<bitfield id="_RSVD" width="1" begin="12" end="12" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="CMDIDLE" width="1" begin="11" end="11" resetval="0" description="Command Idle" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="Idle not commanded"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="Idle commanded (read IDLE is MACSTATUS)"/>
</bitfield>
<bitfield id="TXSHORTGAPEN" width="1" begin="10" end="10" resetval="0" description="Transmit short gap enable" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="TX with a short IPG is disabled"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="TX with a short IPG (when TX_HSORT_GAP input is asserted) is enabled"/>
</bitfield>
<bitfield id="TXPTYPE" width="1" begin="9" end="9" resetval="0" description="Transmit queue priority type" range="" rwaccess="RW">
<bitenum id="RROBIN" value="0" token="RROBIN" description="The queue uses a round-robin scheme to select the next channel for transmission"/>
<bitenum id="CHANNELPRI" value="1" token="CHANNELPRI" description="The queue uses a fixed-priority (channel 7 highest priority) scheme to select the next channel for transmission"/>
</bitfield>
<bitfield id="_RSVD" width="1" begin="8" end="8" resetval="0" description="FIFO RAM processor read/write enable (RAM test mode)" range="" rwaccess="N"/>
<bitfield id="_RSVD" width="1" begin="7" end="7" resetval="0" description="Gigabit mode" range="" rwaccess="N"/>
<bitfield id="TXPACE" width="1" begin="6" end="6" resetval="0" description="Transmit pacing enable" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="TX pacing is disabled"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="TX pacing is enabled"/>
</bitfield>
<bitfield id="GMIIEN" width="1" begin="5" end="5" resetval="0" description="GMII enable" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="GMII RX and TX are held in reset"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="GMII RX and TX are released from reset"/>
</bitfield>
<bitfield id="TXFLOWEN" width="1" begin="4" end="4" resetval="0" description="Transmit flow control enable" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="TX flow control is disabled. Full-duplex mode: incoming pause frames are not acted upon"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="TX flow control is enabled. Full-duplex mode: incoming pause frames are acted upon"/>
</bitfield>
<bitfield id="RXBUFFERFLOWEN" width="1" begin="3" end="3" resetval="0" description="Receive buffer flow control enable" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="RX flow control is disabled. Half-duplex mode: no flow control generated collisions are sent. Full-duplex mode: no outgoing pause frames are sent"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="RX flow control is enabled. Half-duplex mode: collisions are initiated when receive flow control is triggered. Full-duplex mode: outgoing pause frames are sent when receive flow control is triggered"/>
</bitfield>
<bitfield id="_RSVD" width="1" begin="2" end="2" resetval="0" description="Manufacturing test mode" range="" rwaccess="N"/>
<bitfield id="LOOPBACK" width="1" begin="1" end="1" resetval="0" description="Loopback mode" range="" rwaccess="RW">
<bitenum id="DISABLE" value="0" token="DISABLE" description="Loopback mode is disabled"/>
<bitenum id="ENABLE" value="1" token="ENABLE" description="Loopback mode is enabled"/>
</bitfield>
<bitfield id="FULLDUPLEX" width="1" begin="0" end="0" resetval="0" description="Full duplex mode; gigabit mode forces full duplex mode regardless of whether the fullduplex bit isset or not" range="" rwaccess="RW">
<bitenum id="HALFDUPLEX" value="0" token="HALFDUPLEX" description="Half-duplex mode "/>
<bitenum id="FULLDUPLEX" value="1" token="FULLDUPLEX" description="Full-duplex mode"/>
</bitfield>
</register>
     <register id="MACSTATUS" acronym="MACSTATUS" offset="0x164" width="32" description="MAC Status Register">
<bitfield id="IDLE" width="1" begin="31" end="31" resetval="0" description="CPGMAC idle" range="" rwaccess="R">
<bitenum id="NOIDLE" value="0" token="NOIDLE" description="The EMAC is not idle"/>
<bitenum id="IDLE" value="1" token="IDLE" description="The EMAC is in the idle state"/>
</bitfield>
<bitfield id="_RSVD" width="7" begin="30" end="24" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="TXERRCODE" width="4" begin="23" end="20" resetval="0" description="TX host error code " range="0-Fh" rwaccess="R">
<bitenum id="NOERROR" value="0" token="NOERROR" description="No error"/>
<bitenum id="SOPERROR" value="1" token="SOPERROR" description="SOP error"/>
<bitenum id="OWNERSHIP" value="2" token="OWNERSHIP" description="Ownership bit not set in SOP buffer"/>
<bitenum id="NOEOP" value="3" token="NOEOP" description="Zero next buffer descriptor pointer without EOP"/>
<bitenum id="NULLPTR" value="4" token="NULLPTR" description="Zero buffer pointer"/>
<bitenum id="NULLEN" value="5" token="NULLEN" description="Zero buffer length"/>
<bitenum id="LENERROR" value="6" token="LENERROR" description="Packet length error (sum of buffers &amp;lt; packet length)"/>
</bitfield>
<bitfield id="_RSVD" width="1" begin="19" end="19" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="TXERRCH" width="3" begin="18" end="16" resetval="0" description="TX host error channel" range="0-7h" rwaccess="R">
<bitenum id="CHA0" value="0" token="CHA0" description=""/>
<bitenum id="CHA1" value="1" token="CHA1" description=""/>
<bitenum id="CHA2" value="2" token="CHA2" description=""/>
<bitenum id="CHA3" value="3" token="CHA3" description=""/>
<bitenum id="CHA4" value="4" token="CHA4" description=""/>
<bitenum id="CHA5" value="5" token="CHA5" description=""/>
<bitenum id="CHA6" value="6" token="CHA6" description=""/>
<bitenum id="CHA7" value="7" token="CHA7" description=""/>
</bitfield>
<bitfield id="RXERRCODE" width="4" begin="15" end="12" resetval="0" description="RX host error code" range="0-Fh" rwaccess="R">
<bitenum id="NOERROR" value="0" token="NOERROR" description="No error"/>
<bitenum id="OWNERSHIP" value="2" token="OWNERSHIP" description="Ownership bit not set in SOP buffer"/>
<bitenum id="NULLPTR" value="4" token="NULLPTR" description="Zero buffer pointer"/>
</bitfield>
<bitfield id="_RSVD" width="1" begin="11" end="11" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RXERRCH" width="3" begin="10" end="8" resetval="0" description="RX host error channel" range="0-7h" rwaccess="R">
<bitenum id="CHA0" value="0" token="CHA0" description=""/>
<bitenum id="CHA1" value="1" token="CHA1" description=""/>
<bitenum id="CHA2" value="2" token="CHA2" description=""/>
<bitenum id="CHA3" value="3" token="CHA3" description=""/>
<bitenum id="CHA4" value="4" token="CHA4" description=""/>
<bitenum id="CHA5" value="5" token="CHA5" description=""/>
<bitenum id="CHA6" value="6" token="CHA6" description=""/>
<bitenum id="CHA7" value="7" token="CHA7" description=""/>
</bitfield>
<bitfield id="_RSVD" width="3" begin="7" end="5" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="_RSVD" width="1" begin="4" end="4" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="_RSVD" width="1" begin="3" end="3" resetval="0" description="" range="" rwaccess="N"/>
<bitfield id="RXQOSACT" width="1" begin="2" end="2" resetval="0" description="RX Quality of Service active" range="" rwaccess="R">
<bitenum id="DISABLE" value="0" token="DISABLE" description=""/>
<bitenum id="ENABLE" value="1" token="ENABLE" description=""/>
</bitfield>
<bitfield id="RXFLOWACT" width="1" begin="1" end="1" resetval="0" description="RX flow control active" range="" rwaccess="R">
<bitenum id="INACTIVE" value="0" token="INACTIVE" description=""/>
<bitenum id="ACTIVE" value="1" token="ACTIVE" description=""/>
</bitfield>
<bitfield id="TXFLOWACT" width="1" begin="0" end="0" resetval="0" description="TX flow control active" range="" rwaccess="R">
<bitenum id="INACTIVE" value="0" token="INACTIVE" description=""/>
<bitenum id="ACTIVE" value="1" token="ACTIVE" description=""/>
</bitfield>
</register>
     <register id="EMCONTROL" acronym="EMCONTROL" offset="0x168" width="32" description="Emulation Control Register">
<bitfield id="_RSVD" width="30" begin="31" end="2" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="SOFT" width="1" begin="1" end="1" resetval="0" description="Emulation soft bit" range="" rwaccess="RW"/>
<bitfield id="FREE" width="1" begin="0" end="0" resetval="0" description="Emulation free bit" range="" rwaccess="RW"/>
</register>
