IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_emac_tms570ls3x.xml
     <register id="FIFOCONTROL" acronym="FIFOCONTROL" offset="0x16C" width="32" description="FIFO Control Register">
<bitfield id="_RSVD" width="30" begin="31" end="2" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="TXCELLTHRESH" width="2" begin="1" end="0" resetval="2" description="TX FIFO cell threshold" range="0x2-0x3" rwaccess="RW"/>
</register>
     <register id="MACCONFIG" acronym="MACCONFIG" offset="0x170" width="32" description="MAC Configuration Register ">
<bitfield id="TXCELLDEPTH" width="8" begin="31" end="24" resetval="3" description="TX cell depth - the number of cells in the transmit FIFO" range="" rwaccess="R"/>
<bitfield id="RXCELLDEPTH" width="8" begin="23" end="16" resetval="3" description="RX cell depth - the number of cells in the receive FIFO" range="" rwaccess="R"/>
<bitfield id="ADDRESSTYPE" width="8" begin="15" end="8" resetval="2" description="Address type in the design" range="" rwaccess="R"/>
<bitfield id="MACCFIG" width="8" begin="7" end="0" resetval="2" description="MAC configuration value" range="" rwaccess="R"/>
</register>
     <register id="SOFTRESET" acronym="SOFTRESET" offset="0x174" width="32" description="Soft Reset Register ">
<bitfield id="_RSVD" width="31" begin="31" end="1" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="SOFTRESET" width="1" begin="0" end="0" resetval="0" description="Software reset" range="" rwaccess="RW">
<bitenum id="NORESET" value="0" token="NORESET" description=""/>
<bitenum id="RESET" value="1" token="RESET" description=""/>
</bitfield>
</register>
     <register id="MACSRCADDRLO" acronym="MACSRCADDRLO" offset="0x1D0" width="32" description="MAC Source Address Low">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="MACSRCADDR0" width="8" begin="15" end="8" resetval="0" description="MAC source address lower 8 bits MACADDR[7:0]" range="0-FFh" rwaccess="RW"/>
<bitfield id="MACSRCADDR1" width="8" begin="7" end="0" resetval="0" description="MAC source address bits 15:9 MACADDR[15:8]" range="0-FFh" rwaccess="RW"/>
</register>
     <register id="MACSRCADDRHI" acronym="MACSRCADDRHI" offset="0x1D4" width="32" description="MAC Source Address High">
<bitfield id="MACSRCADDR2" width="8" begin="31" end="24" resetval="0" description="MAC source address bits 23:16 (byte 2)" range="0-FFh" rwaccess="RW"/>
<bitfield id="MACSRCADDR3" width="8" begin="23" end="16" resetval="0" description="MAC source address bits 31:23 (byte 3)" range="0-FFh" rwaccess="RW"/>
<bitfield id="MACSRCADDR4" width="8" begin="15" end="8" resetval="0" description="MAC source address bits 39:32 (byte 4)" range="0-FFh" rwaccess="RW"/>
<bitfield id="MACSRCADDR5" width="8" begin="7" end="0" resetval="0" description="MAC source address bits 47:40 (byte 5)" range="0-FFh" rwaccess="RW"/>
</register>
     <register id="MACHASH1" acronym="MACHASH1" offset="0x1D8" width="32" description="MAC Hash Address Register 1">
<bitfield id="MACHASH1" width="32" begin="31" end="0" resetval="0" description="Least-significant 32 bits of the hash table corresponding to hash values 0 to 31" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="MACHASH2" acronym="MACHASH2" offset="0x1DC" width="32" description="MAC Hash Address Register 2">
<bitfield id="MACHASH2" width="32" begin="31" end="0" resetval="0" description="Most-significant 32 bits of the hash table corresponding to hash values 32 to 63" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="BOFFTEST" acronym="BOFFTEST" offset="0x1E0" width="32" description="Back Off Test Register">
<bitfield id="_RSVD" width="6" begin="31" end="26" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="RNDNUM" width="10" begin="25" end="16" resetval="0" description="Backoff random number generator" range="0-3FFh" rwaccess="RW"/>
<bitfield id="COLLCOUNT" width="4" begin="15" end="12" resetval="0" description="Collision count" range="0-Fh" rwaccess="R"/>
<bitfield id="_RSVD" width="2" begin="11" end="10" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="TXBACKOFF" width="10" begin="9" end="0" resetval="0" description="Backoff count" range="0-3FFh" rwaccess="R"/>
</register>
     <register id="TPACETEST" acronym="TPACETEST" offset="0x1E4" width="32" description="Transmit Pacing  Algorithm Test Register ">
<bitfield id="_RSVD" width="27" begin="31" end="5" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="PACEVAL" width="5" begin="4" end="0" resetval="0" description="Pacing register current value" range="0-1Fh" rwaccess="R"/>
</register>
     <register id="RXPAUSE" acronym="RXPAUSE" offset="0x1E8" width="32" description="Receive Pause Timer Register">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="PAUSETIMER" width="16" begin="15" end="0" resetval="0" description="RX pause timer value" range="0-FFFFh" rwaccess="RW"/>
</register>
     <register id="TXPAUSE" acronym="TXPAUSE" offset="0x1EC" width="32" description="Transmit Pause Timer Register">
<bitfield id="_RSVD" width="16" begin="31" end="16" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="PAUSETIMER" width="16" begin="15" end="0" resetval="0" description="TX pause timer value" range="0-FFFFh" rwaccess="RW"/>
</register>
     <register id="MACADDRLO" acronym="MACADDRLO" offset="0x500" width="32" description="MAC Address Low - From Receive Address Matching Memory Map">
<bitfield id="_RSVD" width="11" begin="31" end="21" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="VALID" width="1" begin="20" end="20" resetval="0" description="" range="" rwaccess="RW">
<bitenum id="INVALID" value="0" token="INVALID" description=""/>
<bitenum id="VALID" value="1" token="VALID" description=""/>
</bitfield>
<bitfield id="MATCHFILT" width="1" begin="19" end="19" resetval="0" description="" range="" rwaccess="RW">
<bitenum id="FILTER" value="0" token="FILTER" description=""/>
<bitenum id="MATCH" value="1" token="MATCH" description=""/>
</bitfield>
<bitfield id="CHANNEL" width="3" begin="18" end="16" resetval="0" description="" range="" rwaccess="RW"/>
<bitfield id="MACADDR0" width="8" begin="15" end="8" resetval="0" description="MAC addres lower 8 bits (byte 0)" range="0-FFh" rwaccess="RW"/>
<bitfield id="MACADDR1" width="8" begin="7" end="0" resetval="0" description="MAC addres bits 15:8 (byte 1)" range="" rwaccess="RW"/>
</register>
