IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_emac_tms570ls3x.xml
     <register id="MACADDRHI" acronym="MACADDRHI" offset="0x504" width="32" description="MAC Address High - Receive Address Matching">
<bitfield id="MACADDR2" width="8" begin="31" end="24" resetval="0" description="MAC source address bits 23:16 (byte 2)" range="0-FFh" rwaccess="RW"/>
<bitfield id="MACADDR3" width="8" begin="23" end="16" resetval="0" description="MAC source address bits 31:23 (byte 3)" range="0-FFh" rwaccess="RW"/>
<bitfield id="MACADDR4" width="8" begin="15" end="8" resetval="0" description="MAC source address bits 39:32 (byte 4)" range="0-FFh" rwaccess="RW"/>
<bitfield id="MACADDR5" width="8" begin="7" end="0" resetval="0" description="MAC source address bits 47:40 (byte 5)" range="0-FFh" rwaccess="RW"/>
</register>
     <register id="MACINDEX" acronym="MACINDEX" offset="0x508" width="32" description="MAC Index Register">
<bitfield id="_RSVD" width="27" begin="31" end="5" resetval="0" description="Reserved " range="" rwaccess="N"/>
<bitfield id="MACINDEX" width="5" begin="4" end="0" resetval="0" description="MAC address index" range="0-FFh" rwaccess="RW"/>
</register>
     <register id="TX0HDP" acronym="TX0HDP" offset="0x600" width="32" description="Transmit Channel 0 DMA Head Descriptor Pointer Register">
<bitfield id="TX0HDP" width="32" begin="31" end="0" resetval="0" description="TX channel 0 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="TX1HDP" acronym="TX1HDP" offset="0x604" width="32" description="Transmit Channel 1 DMA Head Descriptor Pointer Register">
<bitfield id="TX1HDP" width="32" begin="31" end="0" resetval="0" description="TX channel 1 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="TX2HDP" acronym="TX2HDP" offset="0x608" width="32" description="Transmit Channel 2 DMA Head Descriptor Pointer Register">
<bitfield id="TX2HDP" width="32" begin="31" end="0" resetval="0" description="TX channel 2 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="TX3HDP" acronym="TX3HDP" offset="0x60C" width="32" description="Transmit Channel 3 DMA Head Descriptor Pointer Register">
<bitfield id="TX3HDP" width="32" begin="31" end="0" resetval="0" description="TX channel 3 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="TX4HDP" acronym="TX4HDP" offset="0x610" width="32" description="Transmit Channel 4 DMA Head Descriptor Pointer Register">
<bitfield id="TX4HDP" width="32" begin="31" end="0" resetval="0" description="TX channel 4 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="TX5HDP" acronym="TX5HDP" offset="0x614" width="32" description="Transmit Channel 5 DMA Head Descriptor Pointer Register">
<bitfield id="TX5HDP" width="32" begin="31" end="0" resetval="0" description="TX channel 5 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="TX6HDP" acronym="TX6HDP" offset="0x618" width="32" description="Transmit Channel 6 DMA Head Descriptor Pointer Register">
<bitfield id="TX6HDP" width="32" begin="31" end="0" resetval="0" description="TX channel 6 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="TX7HDP" acronym="TX7HDP" offset="0x61C" width="32" description="Transmit Channel 7 DMA Head Descriptor Pointer Register">
<bitfield id="TX7HDP" width="32" begin="31" end="0" resetval="0" description="TX channel 7 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX0HDP" acronym="RX0HDP" offset="0x620" width="32" description="Receive Channel 0 DMA Head Descriptor Pointer Register">
<bitfield id="RX0HDP" width="32" begin="31" end="0" resetval="0" description="RX channel 0 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX1HDP" acronym="RX1HDP" offset="0x624" width="32" description="Receive Channel 1 DMA Head Descriptor Pointer Register">
<bitfield id="RX1HDP" width="32" begin="31" end="0" resetval="0" description="RX channel 1 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX2HDP" acronym="RX2HDP" offset="0x628" width="32" description="Receive Channel 2 DMA Head Descriptor Pointer Register">
<bitfield id="RX2HDP" width="32" begin="31" end="0" resetval="0" description="RX channel 2 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX3HDP" acronym="RX3HDP" offset="0x62C" width="32" description="Receive Channel 3 DMA Head Descriptor Pointer Register">
<bitfield id="RX3HDP" width="32" begin="31" end="0" resetval="0" description="RX channel 3 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX4HDP" acronym="RX4HDP" offset="0x630" width="32" description="Receive Channel 4 DMA Head Descriptor Pointer Register">
<bitfield id="RX4HDP" width="32" begin="31" end="0" resetval="0" description="RX channel 4 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX5HDP" acronym="RX5HDP" offset="0x634" width="32" description="Receive Channel 5 DMA Head Descriptor Pointer Register">
<bitfield id="RX5HDP" width="32" begin="31" end="0" resetval="0" description="RX channel 5 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX6HDP" acronym="RX6HDP" offset="0x638" width="32" description="Receive Channel 6 DMA Head Descriptor Pointer Register">
<bitfield id="RX6HDP" width="32" begin="31" end="0" resetval="0" description="RX channel 6 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX7HDP" acronym="RX7HDP" offset="0x63C" width="32" description="Receive Channel 7 DMA Head Descriptor Pointer Register">
<bitfield id="RX7HDP" width="32" begin="31" end="0" resetval="0" description="RX channel 7 DMA Head Descriptor pointer" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
