IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_emac_tms570ls3x.xml
     <register id="TX0CP" acronym="TX0CP" offset="0x640" width="32" description="Transmit Channel 0 Completion Pointer (Interrupt Ack) Register">
<bitfield id="TX0CP" width="32" begin="31" end="0" resetval="0" description="TX channel 0 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="TX1CP" acronym="TX1CP" offset="0x644" width="32" description="Transmit Channel 1 Completion Pointer Register">
<bitfield id="TX1CP" width="32" begin="31" end="0" resetval="0" description="TX channel 1 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="TX2CP" acronym="TX2CP" offset="0x648" width="32" description="Transmit Channel 2 Completion Pointer Register">
<bitfield id="TX2CP" width="32" begin="31" end="0" resetval="0" description="TX channel 2 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="TX3CP" acronym="TX3CP" offset="0x64C" width="32" description="Transmit Channel 3 Completion Pointer Register">
<bitfield id="TX3CP" width="32" begin="31" end="0" resetval="0" description="TX channel 3 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="TX4CP" acronym="TX4CP" offset="0x650" width="32" description="Transmit Channel 4 Completion Pointer Register">
<bitfield id="TX4CP" width="32" begin="31" end="0" resetval="0" description="TX channel 4 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="TX5CP" acronym="TX5CP" offset="0x654" width="32" description="Transmit Channel 5 Completion Pointer Register">
<bitfield id="TX5CP" width="32" begin="31" end="0" resetval="0" description="TX channel 5 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="TX6CP" acronym="TX6CP" offset="0x658" width="32" description="Transmit Channel 6 Completion Pointer Register">
<bitfield id="TX6CP" width="32" begin="31" end="0" resetval="0" description="TX channel 6 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="TX7CP" acronym="TX7CP" offset="0x65C" width="32" description="Transmit Channel 7 Completion Pointer Register">
<bitfield id="TX7CP" width="32" begin="31" end="0" resetval="0" description="TX channel 7 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX0CP" acronym="RX0CP" offset="0x660" width="32" description="Receive Channel 0 Completion Pointer (Interrupt Ack) Register">
<bitfield id="RX0CP" width="32" begin="31" end="0" resetval="0" description="RX channel 0 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX1CP" acronym="RX1CP" offset="0x664" width="32" description="Receive Channel 1 Completion Pointer (Interrupt Ack) Register">
<bitfield id="RX1CP" width="32" begin="31" end="0" resetval="0" description="RX channel 1 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX2CP" acronym="RX2CP" offset="0x668" width="32" description="Receive Channel 2 Completion Pointer (Interrupt Ack) Register">
<bitfield id="RX2CP" width="32" begin="31" end="0" resetval="0" description="RX channel 2 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX3CP" acronym="RX3CP" offset="0x66C" width="32" description="Receive Channel 3 Completion Pointer (Interrupt Ack) Register">
<bitfield id="RX3CP" width="32" begin="31" end="0" resetval="0" description="RX channel 3 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX4CP" acronym="RX4CP" offset="0x670" width="32" description="Receive Channel 4 Completion Pointer (Interrupt Ack) Register">
<bitfield id="RX4CP" width="32" begin="31" end="0" resetval="0" description="RX channel 4 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX5CP" acronym="RX5CP" offset="0x674" width="32" description="Receive Channel 5 Completion Pointer (Interrupt Ack) Register">
<bitfield id="RX5CP" width="32" begin="31" end="0" resetval="0" description="RX channel 5 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX6CP" acronym="RX6CP" offset="0x678" width="32" description="Receive Channel 6 Completion Pointer (Interrupt Ack) Register">
<bitfield id="RX6CP" width="32" begin="31" end="0" resetval="0" description="RX channel 6 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RX7CP" acronym="RX7CP" offset="0x67C" width="32" description="Receive Channel 7 Completion Pointer (Interrupt Ack) Register">
<bitfield id="RX7CP" width="32" begin="31" end="0" resetval="0" description="RX channel 7 completion pointer register" range="0-FFFFFFFFh" rwaccess="RW"/>
</register>
     <register id="RXGOODFRAMES" acronym="RXGOODFRAMES" offset="0x200" width="32" description="Good RX Frames">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="RXBCASTFRAMES" acronym="RXBCASTFRAMES" offset="0x204" width="32" description="Total number of good broadcast frames received">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="RXMCASTFRAMES" acronym="RXMCASTFRAMES" offset="0x208" width="32" description="Total number of good multicast frames received">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="RXPAUSEFRAMES" acronym="RXPAUSEFRAMES" offset="0x20C" width="32" description="Pause RX Frames Register ">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="RXCRCERRORS" acronym="RXCRCERRORS" offset="0x210" width="32" description="Total number of frames received with CRC errors">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="RXALIGNCODEERRORS" acronym="RXALIGNCODEERRORS" offset="0x214" width="32" description="Total number of frames received with alignment/code errors">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
