IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_emac_tms570ls3x.xml
     <register id="RXOVERSIZED" acronym="RXOVERSIZED" offset="0x218" width="32" description="Total number of oversized frames received">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="RXJABBER" acronym="RXJABBER" offset="0x21C" width="32" description="Total number of jabber frames received">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="RXUNDERSIZED" acronym="RXUNDERSIZED" offset="0x220" width="32" description="Total number of undersized frames received">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="RXFRAGMENTS" acronym="RXFRAGMENTS" offset="0x224" width="32" description="RX Frame Fragments Register ">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="RXFILTERED" acronym="RXFILTERED" offset="0x228" width="32" description="Filtered Receive Frames">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="RXQOSFILTERED" acronym="RXQOSFILTERED" offset="0x22C" width="32" description="Received Frames Filtered by QOS">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="RXOCTETS" acronym="RXOCTETS" offset="0x230" width="32" description="Total number of received bytes in good frames">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="TXGOODFRAMES" acronym="TXGOODFRAMES" offset="0x234" width="32" description="Total number of good frames transmitted">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="TXBCASTFRAMES" acronym="TXBCASTFRAMES" offset="0x238" width="32" description="Broadcast TX Frames Register">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="TXMCASTFRAMES" acronym="TXMCASTFRAMES" offset="0x23C" width="32" description="Multicast TX Frames Register">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="TXPAUSEFRAMES" acronym="TXPAUSEFRAMES" offset="0x240" width="32" description="Pause TX Frames Register">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="TXDEFERRED" acronym="TXDEFERRED" offset="0x244" width="32" description="Deferred TX Frames Register">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="TXCOLLISION" acronym="TXCOLLISION" offset="0x248" width="32" description="TX Collision Frames Register">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="TXSINGLECOLL" acronym="TXSINGLECOLL" offset="0x24C" width="32" description="TX Single Collision Frames Register">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="TXMULTICOLL" acronym="TXMULTICOLL" offset="0x250" width="32" description="TX Multiple Collision Frames Register">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="TXEXCESSIVECOLL" acronym="TXEXCESSIVECOLL" offset="0x254" width="32" description="TX Excessive Collision Frames Register">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="TXLATECOLL" acronym="TXLATECOLL" offset="0x258" width="32" description="TX Late Collision Frames Register">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="TXUNDERRUN" acronym="TXUNDERRUN" offset="0x25C" width="32" description="TX Underrun Error Register ">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="TXCARRIERSENSE" acronym="TXCARRIERSENSE" offset="0x260" width="32" description="TX Carrier Sense Errors Register ">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="TXOCTETS" acronym="TXOCTETS" offset="0x264" width="32" description="TX Octet Frames Register ">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="FRAME64" acronym="FRAME64" offset="0x268" width="32" description="Transmit and Receive 64 Octet Frames Register ">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="FRAME65T127" acronym="FRAME65T127" offset="0x26C" width="32" description="Transmit and Receive 65 to 127 Octet Frames Register ">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="FRAME128T255" acronym="FRAME128T255" offset="0x270" width="32" description="Transmit and Receive 128 to 255 Octet Frames Register ">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="FRAME256T511" acronym="FRAME256T511" offset="0x274" width="32" description="Transmit and Receive 256 to 511 Octet Frames Register ">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="FRAME512T1023" acronym="FRAME512T1023" offset="0x278" width="32" description="Transmit and Receive 512 to 1023 Octet Frames Register ">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="FRAME1024TUP" acronym="FRAME1024TUP" offset="0x27C" width="32" description="Transmit and Receive 1024 to 1518 Octet Frames Register ">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="NETOCTETS" acronym="NETOCTETS" offset="0x280" width="32" description="Network Octet Frames Register ">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="RXSOFOVERRUNS" acronym="RXSOFOVERRUNS" offset="0x284" width="32" description="Receive FIFO or DMA Start of Frame Overruns Register ">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="RXMOFOVERRUNS" acronym="RXMOFOVERRUNS" offset="0x288" width="32" description="Receive FIFO or DMA Middle of Frame Overruns Register ">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
     <register id="RXDMAOVERRUNS" acronym="RXDMAOVERRUNS" offset="0x28C" width="32" description="Receive DMA Start of Frame and Middle of Frame Overruns Register ">
<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0" description="Count" range="" rwaccess="RW"/>
</register>
</module>
